export interface Room {
  id: string;
  title: string;
  price: string;
  image: string;
  desc: string;
  size: string;
  beds: string;
  bathroom: string;
  view: string;
  bathroomAmenities: string[];
  roomAmenities: string[];
  smoking: string;
}

export const ROOMS: Room[] = [
  {
    id: 'dormitory',
    title: 'Двоярусне ліжко в змішаному загальному номері',
    price: 'UAH 300',
    image: 'https://cf.bstatic.com/xdata/images/hotel/max1024x768/249020072.jpg?k=e4cb4525d0cdc2e62fababc5702d90ad2366b0bf381c3aded9f4a5ca8401c264&o=',
    desc: 'Ліжко в звуконепроникному загальному номері із супутниковим телебаченням.',
    size: '37 м²',
    beds: '1 двоярусне ліжко',
    bathroom: 'Спільна ванна кімната',
    view: 'Вид на внутрішній двір',
    bathroomAmenities: ['Туалетно-косметичні засоби', 'Туалет', 'Ванна або душ', 'Спільний туалет', 'Фен', 'Туалетний папір'],
    roomAmenities: ['Телевізор', 'Білизна', 'Килимове покриття', 'Телевізор із плоским екраном', 'Праска', 'Опалення', 'Кабельні канали', 'Рушники', 'Шафа або гардероб', 'Звукоізоляція', 'Супутникові канали', 'Розетка поблизу з ліжком', 'Вішалка для одягу', 'На верхні поверхи можна піднятися тільки сходами'],
    smoking: 'Для некурців'
  },
  {
    id: 'semi-lux',
    title: 'Напівлюкс',
    price: 'UAH 1 200',
    image: 'https://cf.bstatic.com/xdata/images/hotel/max1024x768/280472714.jpg?k=890b53c30fedb98098be5488be14c4c37dc3963e0f6dce21111423a89441bc0c&o=',
    desc: 'Напівлюкс із кабельним телебаченням і окремою ванною кімнатою з феном. Цей номер вирізняється більш просторим плануванням і наявністю зони відпочинку.',
    size: '20 м²',
    beds: '2 дивана-ліжка і 1 широке двоспальне ліжко',
    bathroom: 'Власна ванна кімната',
    view: 'Вид на внутрішній двір',
    bathroomAmenities: ['Ванна', 'Туалетно-косметичні засоби', 'Душ', 'Туалет', 'Фен', 'Туалетний папір'],
    roomAmenities: ['Дерев\'яна або паркетна підлога', 'Обідній стіл', 'Телевізор із плоским екраном', 'Праска', 'Рушники', 'Вітальня/м\'який куток', 'Розетка поблизу з ліжком', 'Розкладне ліжко', 'Телевізор', 'Білизна', 'Килимове покриття', 'Опалення', 'Кабельні канали', 'Шафа або гардероб', 'Звукоізоляція', 'Супутникові канали', 'Вішалка для одягу', 'На верхні поверхи можна піднятися тільки сходами'],
    smoking: 'Для некурців'
  },
  {
    id: 'lux',
    title: 'Люкс',
    price: 'UAH 1 400',
    image: 'https://cf.bstatic.com/xdata/images/hotel/max1024x768/249020806.jpg?k=4a9239d8937e47ba19eadf498f1cb94df939b7e6c0da77aa17082dfc59caf88f&o=',
    desc: 'Люкс із кабельним телебаченням і окремою ванною кімнатою з феном. До послуг гостей зона відпочинку та холодильник. Він вирізняється більш просторим плануванням.',
    size: '30 м²',
    beds: '1 диван-ліжко і 1 широке двоспальне ліжко',
    bathroom: 'Власна ванна кімната',
    view: 'Вид на внутрішній двір',
    bathroomAmenities: ['Ванна', 'Туалетно-косметичні засоби', 'Душ', 'Туалет', 'Капці', 'Фен', 'Туалетний папір'],
    roomAmenities: ['Робочий стіл', 'Обідній стіл', 'Телевізор із плоским екраном', 'Диван', 'Праска', 'Рушники', 'Вітальня/м\'який куток', 'Розетка поблизу з ліжком', 'Телевізор', 'Холодильник', 'Білизна', 'Плиткова/мармурова підлога', 'Килимове покриття', 'Диван-ліжко', 'Індивідуальний кондиціонер', 'Опалення', 'Кабельні канали', 'Шафа або гардероб', 'Звукоізоляція', 'Супутникові канали', 'Кондиціонер', 'Вішалка для одягу', 'На верхні поверхи можна піднятися тільки сходами'],
    smoking: 'Для некурців'
  },
  {
    id: 'family-lux',
    title: 'Сімейний люкс',
    price: 'UAH 1 400',
    image: 'https://cf.bstatic.com/xdata/images/hotel/max1024x768/185029725.jpg?k=a369fd23a53875e505c560c4ba7a5d66781730c47b429415da26b7cd78bd174a&o=',
    desc: 'Сімейний номер із власною ванною кімнатою, душем та феном. Звукоізоляція, шафа, паркетна підлога, телевізор із кабельними каналами та вид на внутрішній двір. 3 ліжка.',
    size: '28 м²',
    beds: '1 односпальне ліжко, 1 двоярусне ліжко і 1 диван-ліжко',
    bathroom: 'Власна ванна кімната',
    view: 'Вид на внутрішній двір',
    bathroomAmenities: ['Ванна', 'Туалетно-косметичні засоби', 'Душ', 'Туалет', 'Капці', 'Фен', 'Туалетний папір'],
    roomAmenities: ['Дерев\'яна або паркетна підлога', 'Обідній стіл', 'Телевізор із плоским екраном', 'Праска', 'Рушники', 'Розетка поблизу з ліжком', 'Розкладне ліжко', 'Телевізор', 'Холодильник', 'Білизна', 'Плиткова/мармурова підлога', 'Килимове покриття', 'Опалення', 'Кабельні канали', 'Шафа або гардероб', 'Звукоізоляція', 'Супутникові канали', 'Вішалка для одягу', 'На верхні поверхи можна піднятися тільки сходами'],
    smoking: 'Для некурців'
  },
  {
    id: 'deluxe-apartment',
    title: 'Апартаменти Делюкс з 1 спальнею',
    price: 'UAH 2 000',
    image: 'https://cf.bstatic.com/xdata/images/hotel/max1024x768/863538608.jpg?k=d9a6773624b1e8603a1ca9fbae363adb0a3060b61d27cc3448cc89d3365c319b&o=',
    desc: 'Апартаменти з кондиціонером, 1 спальнею і ванною кімнатою з ванною та душем. Звукоізоляція, чайник/кавоварка, обідня зона, шафа та телевізор із кабельними каналами.',
    size: '35 м²',
    beds: '1 широке двоспальне ліжко',
    bathroom: 'Власна ванна кімната',
    view: '',
    bathroomAmenities: ['Ванна', 'Туалетно-косметичні засоби', 'Душ', 'Туалет', 'Фен', 'Туалетний папір'],
    roomAmenities: ['Обідній стіл', 'Телевізор із плоским екраном', 'Праска', 'Рушники', 'Розетка поблизу з ліжком', 'Чайник/кавоварка', 'Мікрохвильова піч', 'Телевізор', 'Холодильник', 'Білизна', 'Плиткова/мармурова підлога', 'Килимове покриття', 'Кухонний посуд', 'Електрочайник', 'Індивідуальний кондиціонер', 'Опалення', 'Кабельні канали', 'Шафа або гардероб', 'Звукоізоляція', 'Кондиціонер', 'Обідня зона', 'Вішалка для одягу', 'На верхні поверхи можна піднятися тільки сходами'],
    smoking: 'Для некурців'
  }
];
